# Synthesis script for yosys created by qflow
read_liberty -lib -ignore_miss_dir -setattr blackbox /usr/share/qflow/tech/osu050/osu05_stdcells.lib
read_verilog -sv arbiter.sv
# Hierarchy check
hierarchy -check
